{
  "en": {
    "title": "Privacy Policy",
    "home_text": "Home",
    "copyright": "© 2025 H190K Store. All rights reserved.",
    "content": [
      "<h2>1. Information We Collect</h2>",
      "<p>We collect various types of information in connection with the services we provide, including:</p>",
      "<ul>",
      "<li><b>Personal Information:</b> Such as your name, email address, shipping address, and payment details when you make a purchase.</li>",
      "<li><b>Usage Data:</b> Information on how the service is accessed and used, including your computer's IP address, browser type, browser version, the pages of our service that you visit, the time and date of your visit, the time spent on those pages, unique device identifiers and other diagnostic data.</li>",
      "<li><b>Cookies and Tracking Technologies:</b> We use cookies and similar tracking technologies to track the activity on our service and hold certain information.</li>",
      "</ul>",
      "<h2>2. How We Use Your Information</h2>",
      "<p>We use the collected data for various purposes:</p>",
      "<ul>",
      "<li>To provide and maintain our Service</li>",
      "<li>To notify you about changes to our Service</li>",
      "<li>To allow you to participate in interactive features of our Service when you choose to do so</li>",
      "<li>To provide customer support</li>",
      "<li>To gather analysis or valuable information so that we can improve our Service</li>",
      "<li>To monitor the usage of our Service</li>",
      "<li>To detect, prevent and address technical issues</li>",
      "</ul>",
      "<h2>3. Information Sharing and Disclosure</h2>",
      "<p>We do not share personal information with third parties except in the following limited circumstances:</p>",
      "<ul>",
      "<li><b>With Service Providers:</b> We may employ third party companies and individuals to facilitate our Service, to provide the Service on our behalf, to perform Service-related services or to assist us in analyzing how our Service is used.</li>",
      "<li><b>For Legal Reasons:</b> If required to do so by law or in response to valid requests by public authorities (e.g. a court or a government agency).</li>",
      "<li><b>Business Transfers:</b> If we are involved in a merger, acquisition or asset sale, your Personal Data may be transferred.</li>",
      "</ul>",
      "<h2>4. Security of Data</h2>",
      "<p>The security of your data is important to us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While we strive to use commercially acceptable means to protect your Personal Data, we cannot guarantee its absolute security.</p>",
      "<h2>5. Your Data Protection Rights</h2>",
      "<p>Depending on your location, you may have the following rights regarding your personal data:</p>",
      "<ul>",
      "<li>The right to access, update or to delete the information we have on you.</li>",
      "<li>The right to rectify your information.</li>",
      "<li>The right to object to our processing of your Personal Data.</li>",
      "<li>The right to request the restriction of the processing of your personal information.</li>",
      "<li>The right to data portability.</li>",
      "<li>The right to withdraw consent.</li>",
      "</ul>",
      "<p>We may ask you to verify your identity before responding to such requests.</p>",
      "<h2>6. Changes to This Privacy Policy</h2>",
      "<p>We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page. You are advised to review this Privacy Policy periodically for any changes.</p>",
      "<h2>7. Contact Us</h2>",
      "<p>If you have any questions about this Privacy Policy, please contact us:</p>",
      "<ul>",
      "<li>By email: <a href=\"mailto:support@h190k.com\">support@h190k.com</a></li>",
      "</ul>"
    ]
  },
  "ar": {
    "title": "سياسة الخصوصية",
    "home_text": "الرئيسية",
    "copyright": "© 2025 متجر H190K. جميع الحقوق محفوظة.",
    "content": [
      "<h2>1. المعلومات التي نجمعها</h2>",
      "<p>نقوم بجمع أنواع مختلفة من المعلومات فيما يتعلق بالخدمات التي نقدمها، بما في ذلك:</p>",
      "<ul>",
      "<li><b>المعلومات الشخصية:</b> مثل اسمك، عنوان بريدك الإلكتروني، عنوان الشحن، وتفاصيل الدفع عند قيامك بعملية شراء.</li>",
      "<li><b>بيانات الاستخدام:</b> معلومات حول كيفية الوصول إلى الخدمة واستخدامها، بما في ذلك عنوان IP لجهاز الكمبيوتر الخاص بك، نوع المتصفح، إصدار المتصفح، الصفحات التي تزورها من خدمتنا، وقت وتاريخ زيارتك، الوقت المستغرق في تلك الصفحات، معرفات الجهاز الفريدة وبيانات التشخيص الأخرى.</li>",
      "<li><b>ملفات تعريف الارتباط وتقنيات التتبع:</b> نستخدم ملفات تعريف الارتباط وتقنيات التتبع المماثلة لتتبع النشاط على خدمتنا والاحتفاظ بمعلومات معينة.</li>",
      "</ul>",
      "<h2>2. كيف نستخدم معلوماتك</h2>",
      "<p>نستخدم البيانات التي تم جمعها لأغراض مختلفة:</p>",
      "<ul>",
      "<li>لتوفير خدمتنا وصيانتها</li>",
      "<li>لإعلامك بالتغييرات التي تطرأ على خدمتنا</li>",
      "<li>للسماح لك بالمشاركة في الميزات التفاعلية لخدمتنا عندما تختار القيام بذلك</li>",
      "<li>لتقديم دعم العملاء</li>",
      "<li>لجمع التحليلات أو المعلومات القيمة حتى نتمكن من تحسين خدمتنا</li>",
      "<li>لمراقبة استخدام خدمتنا</li>",
      "<li>لاكتشاف ومنع ومعالجة المشكلات الفنية</li>",
      "</ul>",
      "<h2>3. مشاركة المعلومات والإفصاح عنها</h2>",
      "<p>لا نشارك المعلومات الشخصية مع أطراف ثالثة إلا في الظروف المحدودة التالية:</p>",
      "<ul>",
      "<li><b>مع مزودي الخدمة:</b> قد نوظف شركات وأفرادًا من طرف ثالث لتسهيل خدمتنا، لتقديم الخدمة نيابة عنا، لأداء الخدمات المتعلقة بالخدمة أو لمساعدتنا في تحليل كيفية استخدام خدمتنا.</li>",
      "<li><b>لأسباب قانونية:</b> إذا كان ذلك مطلوبًا بموجب القانون أو استجابة لطلبات صحيحة من السلطات العامة (مثل محكمة أو وكالة حكومية).</li>",
      "<li><b>تحويلات الأعمال:</b> إذا كنا مشاركين في عملية دمج أو استحواذ أو بيع أصول، فقد يتم نقل بياناتك الشخصية.</li>",
      "</ul>",
      "<h2>4. أمان البيانات</h2>",
      "<p>أمان بياناتك مهم بالنسبة لنا، ولكن تذكر أنه لا توجد طريقة إرسال عبر الإنترنت أو طريقة تخزين إلكتروني آمنة بنسبة 100%. بينما نسعى جاهدين لاستخدام وسائل مقبولة تجاريًا لحماية بياناتك الشخصية، لا يمكننا ضمان أمانها المطلق.</p>",
      "<h2>5. حقوق حماية البيانات الخاصة بك</h2>",
      "<p>اعتمادًا على موقعك، قد يكون لديك الحقوق التالية فيما يتعلق ببياناتك الشخصية:</p>",
      "<ul>",
      "<li>الحق في الوصول إلى المعلومات التي لدينا عنك أو تحديثها أو حذفها.</li>",
      "<li>الحق في تصحيح معلوماتك.</li>",
      "<li>الحق في الاعتراض على معالجتنا لبياناتك الشخصية.</li>",
      "<li>الحق في طلب تقييد معالجة معلوماتك الشخصية.</li>",
      "<li>الحق في نقل البيانات.</li>",
      "<li>الحق في سحب الموافقة.</li>",
      "</ul>",
      "<p>قد نطلب منك التحقق من هويتك قبل الاستجابة لهذه الطلبات.</p>",
      "<h2>6. التغييرات على سياسة الخصوصية هذه</h2>",
      "<p>قد نقوم بتحديث سياسة الخصوصية الخاصة بنا من وقت لآخر. سنخطرك بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة. يُنصح بمراجعة سياسة الخصوصية هذه بشكل دوري لأي تغييرات.</p>",
      "<h2>7. اتصل بنا</h2>",
      "<p>إذا كان لديك أي أسئلة حول سياسة الخصوصية هذه، يرجى الاتصال بنا:</p>",
      "<ul>",
      "<li>عبر البريد الإلكتروني: <a href=\"mailto:support@h190k.com\">support@h190k.com</a></li>",
      "</ul>"
    ]
  },
  "tr": {
    "title": "Gizlilik Politikası",
    "home_text": "Ana Sayfa",
    "copyright": "© 2025 H190K Store. Tüm hakları saklıdır.",
    "content": [
      "<h2>1. Topladığımız Bilgiler</h2>",
      "<p>Sağladığımız hizmetlerle bağlantılı olarak çeşitli bilgi türleri topluyoruz, bunlar:</p>",
      "<ul>",
      "<li><b>Kişisel Bilgiler:</b> Adınız, e-posta adresiniz, gönderim adresiniz ve bir satın alma işlemi yaptığınızda ödeme bilgileriniz gibi.</li>",
      "<li><b>Kullanım Verileri:</b> Hizmete nasıl erişildiği ve kullanıldığına dair bilgiler, bilgisayarınızın IP adresi, tarayıcı türü, tarayıcı sürümü, hizmetimizin ziyaret ettiğiniz sayfaları, ziyaretinizin saati ve tarihi, bu sayfalarda geçirilen süre, benzersiz cihaz tanımlayıcıları ve diğer teşhis verileri dahil.</li>",
      "<li><b>Çerezler ve İzleme Teknolojileri:</b> Hizmetimizdeki etkinliği izlemek ve belirli bilgileri tutmak için çerezleri ve benzer izleme teknolojilerini kullanırız.</li>",
      "</ul>",
      "<h2>2. Bilgilerinizi Nasıl Kullanıyoruz</h2>",
      "<p>Toplanan verileri çeşitli amaçlar için kullanırız:</p>",
      "<ul>",
      "<li>Hizmetimizi sağlamak ve sürdürmek için</li>",
      "<li>Hizmetimizdeki değişiklikler hakkında sizi bilgilendirmek için</li>",
      "<li>Seçtiğinizde hizmetimizin etkileşimli özelliklerine katılmanızı sağlamak için</li>",
      "<li>Müşteri desteği sağlamak için</li>",
      "<li>Hizmetimizi geliştirebilmemiz için analiz veya değerli bilgiler toplamak için</li>",
      "<li>Hizmetimizin kullanımını izlemek için</li>",
      "<li>Teknik sorunları tespit etmek, önlemek ve ele almak için</li>",
      "</ul>",
      "<h2>3. Bilgi Paylaşımı ve Açıklama</h2>",
      "<p>Kişisel bilgileri üçüncü taraflarla yalnızca aşağıdaki sınırlı durumlarda paylaşırız:</p>",
      "<ul>",
      "<li><b>Hizmet Sağlayıcılarla:</b> Hizmetimizi kolaylaştırmak, hizmeti adımıza sağlamak, hizmetle ilgili hizmetleri gerçekleştirmek veya hizmetimizin nasıl kullanıldığını analiz etmemize yardımcı olmak için üçüncü taraf şirketleri ve bireyleri istihdam edebiliriz.</li>",
      "<li><b>Yasal Nedenlerle:</b> Yasa gereği veya kamu otoritelerinin (örn. mahkeme veya devlet kurumu) geçerli taleplerine yanıt olarak.</li>",
      "<li><b>İş Transferleri:</b> Bir birleşme, satın alma veya varlık satışına dahil olursak, Kişisel Verileriniz aktarılabilir.</li>",
      "</ul>",
      "<h2>4. Veri Güvenliği</h2>",
      "<p>Verilerinizin güvenliği bizim için önemlidir, ancak İnternet üzerinden hiçbir aktarım yönteminin veya elektronik depolama yönteminin %100 güvenli olmadığını unutmayın. Kişisel Verilerinizi korumak için ticari olarak kabul edilebilir yöntemleri kullanmaya çalışsak da, mutlak güvenliğini garanti edemeyiz.</p>",
      "<h2>5. Veri Koruma Haklarınız</h2>",
      "<p>Bulunduğunuz yere bağlı olarak, kişisel verilerinizle ilgili aşağıdaki haklara sahip olabilirsiniz:</p>",
      "<ul>",
      "<li>Hakkınızda sahip olduğumuz bilgilere erişme, güncelleme veya silme hakkı.</li>",
      "<li>Bilgilerinizi düzeltme hakkı.</li>",
      "<li>Kişisel Verilerinizin işlenmesine itiraz etme hakkı.</li>",
      "<li>Kişisel bilgilerinizin işlenmesinin kısıtlanmasını talep etme hakkı.</li>",
      "<li>Veri taşınabilirliği hakkı.</li>",
      "<li>Onayı geri çekme hakkı.</li>",
      "</ul>",
      "<p>Bu tür taleplere yanıt vermeden önce kimliğinizi doğrulamanızı isteyebiliriz.</p>",
      "<h2>6. Bu Gizlilik Politikasındaki Değişiklikler</h2>",
      "<p>Gizlilik Politikamızı zaman zaman güncelleyebiliriz. Herhangi bir değişikliği, yeni Gizlilik Politikasını bu sayfada yayınlayarak size bildireceğiz. Herhangi bir değişiklik için bu Gizlilik Politikasını düzenli olarak gözden geçirmeniz tavsiye edilir.</p>",
      "<h2>7. Bize Ulaşın</h2>",
      "<p>Bu Gizlilik Politikası hakkında herhangi bir sorunuz varsa, lütfen bizimle iletişime geçin:</p>",
      "<ul>",
      "<li>E-posta ile: <a href=\"mailto:support@h190k.com\">support@h190k.com</a></li>",
      "</ul>"
    ]
  }
}